Repository: alazarale/mbldg
Catalog: locale/*/LC_MESSAGES/django.po
Languages: am

source: name
am: ስም

source: email
am: ኢሜል

source: message
am: መልክት

source: Home
am: መግቢያ

source: Service
am: አገልግሎት

source: Products
am: ምርቶች

source: All
am: ሁሉም

source: Building
am: ህንፃ

source: Dairy farm
am: ከብት እርባታ

source: Poultry
am: ዶሮ እርባታ

source: News
am: ዜና

source: About-us
am: ስለ እኛ

source: Contact
am: ማግኛ

source: Gallery
am: ጋለሪ

source: building
am: ህንፃ

source: Farm
am: እርሻ

source: Language
am: ቋንቋ

source: Come and let us grow together our nation!
am: ይምጡና ሀገራችንን በጋራ እናሳድግ!!

source: Find your place with us
am: ይምጡና በጋራ እንስራ!!

source: Grow your business here!!
am: ይምጡና ሀገራችንን በጋራ እናሳድግ!!

source: The sooner we talk, the sooner you’ll secure a prime location in a growing business location
am: ይምጡና በጋራ እንስራ!!

source: developed by
am: የተሰራው በ

source: Commercial Building
am: የንግድ ህንፃ

source: General Manager of MALEMU Integrated Farm and Commercial businesses
am: የ MALEMU Integrated Farm and Commercial businesses ዋና አስተዳዳሪ

source: Name
am: ስም

source: Michael Alemu
am: ሚካኤል አለሙ

source: Or use Google map
am: ወይም ጎግል ካርታን በመጠቀም

source: Contact Us!
am: ያግኙን!

source: PRICE:
am: ዋጋ

source: birr
am: ብር

source: Category
am: ምድብ

source: Recent stories
am: የቅርብ ዜናዎች

source: Comments
am: አስተያየቶች

source: There are no comments. Be the first to comment
am: ምንም አስተያየቶች የለም። አስተያየት በመስጠት የመጀመሪያ ይሁኑ

source: Your comment has been added
am: አስተያየቶ ተጨምሮዋል

source: Add a new comment
am: አዲስ አስተያየት ጨምር

source: See more
am: ተጨማሪ ተመልከት

source: Our products
am: ምርቶቻችን

source: See description
am: መግለጫውን ተመልከት

source: Price:
am: ዋጋ

source: Other products
am: ሌላ ምርቶች

source: Latest news from our blog
am: የቅርብ ዜናዎች ከ ብሎጋችን

source: Read more
am: ተጨማሪ አንብብ

source: Our services
am: አገልግሎቶቻችን

source: Our Farmers
am: ግብርናችን

source: Photo gallery categories
am: የምስል ጋለሪ ምድቦች

source: Farm Land
am: የአርሻ መሬት

source: Previous
am: ያለፈ

source: Next
am: ቀጣይ

source: English
am: ኢንግሊዘኛ

source: Amharic
am: አማርኛ
